declare @data nvarchar(max) = '{
    "result": [
        {
            "id": 94800,
            "value": "Автоматический выключатель",
            "info": "",
            "picture": ""
        },
        {
            "id": 94801,
            "value": "Вилка электрическая",
            "info": "",
            "picture": ""
        },
        {
            "id": 94802,
            "value": "Выключатель",
            "info": "",
            "picture": ""
        },
        {
            "id": 94803,
            "value": "Датчик",
            "info": "",
            "picture": ""
        },
        {
            "id": 94804,
            "value": "Диммер",
            "info": "",
            "picture": ""
        },
        {
            "id": 94805,
            "value": "Дифференциальный автомат",
            "info": "",
            "picture": ""
        },
        {
            "id": 94806,
            "value": "Заглушка для розеток",
            "info": "",
            "picture": ""
        },
        {
            "id": 94808,
            "value": "Клемма",
            "info": "",
            "picture": ""
        },
        {
            "id": 94809,
            "value": "Колодка клеммная",
            "info": "",
            "picture": ""
        },
        {
            "id": 94810,
            "value": "Коробка установочная",
            "info": "",
            "picture": ""
        },
        {
            "id": 94811,
            "value": "Крепление электрокабеля",
            "info": "",
            "picture": ""
        },
        {
            "id": 94812,
            "value": "Рамка электроустановочная",
            "info": "",
            "picture": ""
        },
        {
            "id": 94814,
            "value": "Розетка",
            "info": "",
            "picture": ""
        },
        {
            "id": 94815,
            "value": "Розеточно-клавишный блок",
            "info": "",
            "picture": ""
        },
        {
            "id": 94816,
            "value": "Соединительный изолирующий зажим",
            "info": "",
            "picture": ""
        },
        {
            "id": 94818,
            "value": "УЗО",
            "info": "",
            "picture": ""
        },
        {
            "id": 94820,
            "value": "Управление жалюзи",
            "info": "",
            "picture": ""
        },
        {
            "id": 94821,
            "value": "Штепсельное гнездо",
            "info": "",
            "picture": ""
        },
        {
            "id": 97662,
            "value": "Счетчик электроэнергии",
            "info": "",
            "picture": ""
        },
        {
            "id": 97670,
            "value": "Автоматический ввод резерва",
            "info": "",
            "picture": ""
        },
        {
            "id": 97671,
            "value": "Блок комплексной защиты сети",
            "info": "",
            "picture": ""
        },
        {
            "id": 98597,
            "value": "Нулевая шина",
            "info": "",
            "picture": ""
        },
        {
            "id": 98598,
            "value": "Дин-рейка",
            "info": "",
            "picture": ""
        },
        {
            "id": 98599,
            "value": "Кабельная бирка",
            "info": "",
            "picture": ""
        },
        {
            "id": 98600,
            "value": "Коробка наружного монтажа",
            "info": "",
            "picture": ""
        },
        {
            "id": 99039,
            "value": "Изоляционный материал",
            "info": "",
            "picture": ""
        },
        {
            "id": 99040,
            "value": "Контактор",
            "info": "",
            "picture": ""
        },
        {
            "id": 99041,
            "value": "Распределительная коробка",
            "info": "",
            "picture": ""
        },
        {
            "id": 99388,
            "value": "Сетевой шнур с вилкой",
            "info": "",
            "picture": ""
        },
        {
            "id": 115012247,
            "value": "Колпачок для розетки",
            "info": "",
            "picture": ""
        },
        {
            "id": 115012248,
            "value": "Колпачок для вилки",
            "info": "",
            "picture": ""
        },
        {
            "id": 115950803,
            "value": "Реле",
            "info": "",
            "picture": ""
        },
        {
            "id": 115950911,
            "value": "Выключатель для сауны",
            "info": "",
            "picture": ""
        },
        {
            "id": 321057674,
            "value": "Распределительный щит",
            "info": "",
            "picture": ""
        },
        {
            "id": 365845553,
            "value": "Антизакручиватель для телефонной трубки",
            "info": "",
            "picture": ""
        },
        {
            "id": 970573093,
            "value": "Реле времени",
            "info": "",
            "picture": ""
        },
        {
            "id": 970607535,
            "value": "Телекоммуникационный шкаф",
            "info": "",
            "picture": ""
        },
        {
            "id": 970619385,
            "value": "Втулочный наконечник",
            "info": "",
            "picture": ""
        },
        {
            "id": 970669851,
            "value": "Монтажная плата",
            "info": "",
            "picture": ""
        },
        {
            "id": 970669896,
            "value": "Соединительная шина для автоматов",
            "info": "",
            "picture": ""
        },
        {
            "id": 970671669,
            "value": "Вывод кабеля",
            "info": "",
            "picture": ""
        },
        {
            "id": 970684981,
            "value": "Гильза соединительная",
            "info": "",
            "picture": ""
        },
        {
            "id": 970691382,
            "value": "Проходной выключатель (переключатель)",
            "info": "",
            "picture": ""
        },
        {
            "id": 970692179,
            "value": "Лицевая панель для выключателя",
            "info": "",
            "picture": ""
        },
        {
            "id": 970692180,
            "value": "Лицевая панель для розетки",
            "info": "",
            "picture": ""
        },
        {
            "id": 970693192,
            "value": "Маркер для реле",
            "info": "",
            "picture": ""
        },
        {
            "id": 970693202,
            "value": "Диодный блок",
            "info": "",
            "picture": ""
        },
        {
            "id": 970743718,
            "value": "Распределительный шкаф",
            "info": "",
            "picture": ""
        },
        {
            "id": 970743826,
            "value": "Ответвитель прокалывающий",
            "info": "",
            "picture": ""
        },
        {
            "id": 970781817,
            "value": "Лента огнегасящая",
            "info": "",
            "picture": ""
        },
        {
            "id": 970781818,
            "value": "Пластина огнегасящая",
            "info": "",
            "picture": ""
        },
        {
            "id": 970791958,
            "value": "Плавкая вставка (предохранитель)",
            "info": "",
            "picture": ""
        },
        {
            "id": 970791959,
            "value": "Держатель предохранителя",
            "info": "",
            "picture": ""
        },
        {
            "id": 970791960,
            "value": "Рубильник",
            "info": "",
            "picture": ""
        },
        {
            "id": 970791961,
            "value": "Кнопочный пост",
            "info": "",
            "picture": ""
        },
        {
            "id": 970791962,
            "value": "Корпус кнопочного поста",
            "info": "",
            "picture": ""
        },
        {
            "id": 970791963,
            "value": "Силовой ящик с рубильником",
            "info": "",
            "picture": ""
        },
        {
            "id": 970791964,
            "value": "Ограничитель перенапряжения",
            "info": "",
            "picture": ""
        },
        {
            "id": 970791965,
            "value": "Контактный блок",
            "info": "",
            "picture": ""
        },
        {
            "id": 970791966,
            "value": "Лицевая панель сирены",
            "info": "",
            "picture": ""
        },
        {
            "id": 970841937,
            "value": "Лючок для фальшпола",
            "info": "",
            "picture": ""
        },
        {
            "id": 970843510,
            "value": "Кабельный ввод, сальник, гермоввод",
            "info": "",
            "picture": ""
        },
        {
            "id": 970851836,
            "value": "Комбинационный модуль",
            "info": "",
            "picture": ""
        },
        {
            "id": 970853450,
            "value": "Выключатель нагрузки",
            "info": "",
            "picture": ""
        },
        {
            "id": 970853533,
            "value": "Ограничитель мощности",
            "info": "",
            "picture": ""
        },
        {
            "id": 970853534,
            "value": "Фотореле",
            "info": "",
            "picture": ""
        },
        {
            "id": 970853535,
            "value": "Реле тока",
            "info": "",
            "picture": ""
        },
        {
            "id": 970853536,
            "value": "Реле контроля фаз",
            "info": "",
            "picture": ""
        },
        {
            "id": 970853539,
            "value": "Реле контроля уровня",
            "info": "",
            "picture": ""
        },
        {
            "id": 970853540,
            "value": "Реле импульсное",
            "info": "",
            "picture": ""
        },
        {
            "id": 970853541,
            "value": "Реле напряжения",
            "info": "",
            "picture": ""
        },
        {
            "id": 970853846,
            "value": "Переключатель фаз",
            "info": "",
            "picture": ""
        },
        {
            "id": 970853887,
            "value": "Амперметр/вольтметр",
            "info": "",
            "picture": ""
        },
        {
            "id": 970853958,
            "value": "Расцепитель",
            "info": "",
            "picture": ""
        },
        {
            "id": 970853959,
            "value": "Автомат защиты двигателя (мотор-автомат)",
            "info": "",
            "picture": ""
        },
        {
            "id": 970853968,
            "value": "Переключатель",
            "info": "",
            "picture": ""
        },
        {
            "id": 970854120,
            "value": "Кабельный наконечник",
            "info": "",
            "picture": ""
        },
        {
            "id": 970855902,
            "value": "Блок питания на DIN-рейку",
            "info": "",
            "picture": ""
        },
        {
            "id": 970855926,
            "value": "Устройство защиты от импульсных перенапряжений",
            "info": "",
            "picture": ""
        },
        {
            "id": 970855944,
            "value": "Принадлежность для автоматического выключателя",
            "info": "",
            "picture": ""
        },
        {
            "id": 970856050,
            "value": "Щитовой звонок",
            "info": "",
            "picture": ""
        },
        {
            "id": 970857659,
            "value": "Распределительный блок",
            "info": "",
            "picture": ""
        },
        {
            "id": 970857782,
            "value": "Распаячная коробка",
            "info": "",
            "picture": ""
        },
        {
            "id": 970857834,
            "value": "Разветвительная коробка",
            "info": "",
            "picture": ""
        },
        {
            "id": 970859599,
            "value": "Вспомогательный контактный элемент",
            "info": "",
            "picture": ""
        },
        {
            "id": 970861080,
            "value": "Огнестойкая кабельная проходка",
            "info": "",
            "picture": ""
        },
        {
            "id": 970882088,
            "value": "Зажим Крокодил",
            "info": "",
            "picture": ""
        },
        {
            "id": 970897077,
            "value": "Профиль для защиты кромок",
            "info": "",
            "picture": ""
        },
        {
            "id": 970905005,
            "value": "Устройство защиты от искрения",
            "info": "",
            "picture": ""
        },
        {
            "id": 970946518,
            "value": "Твердотельное реле",
            "info": "",
            "picture": ""
        },
        {
            "id": 970954908,
            "value": "Радиатор охлаждения реле",
            "info": "",
            "picture": ""
        },
        {
            "id": 970960652,
            "value": "Преобразователь частоты",
            "info": "",
            "picture": ""
        },
        {
            "id": 970971275,
            "value": "Комплект вилка-розетка",
            "info": "",
            "picture": ""
        },
        {
            "id": 970978662,
            "value": "Обогреватель для электротехнических шкафов",
            "info": "",
            "picture": ""
        },
        {
            "id": 970981338,
            "value": "Изолятор",
            "info": "",
            "picture": ""
        },
        {
            "id": 970990352,
            "value": "Сжим ответвительный (орех)",
            "info": "",
            "picture": ""
        },
        {
            "id": 970994138,
            "value": "Щит учета электроэнергии в сборе",
            "info": "",
            "picture": ""
        },
        {
            "id": 970994238,
            "value": "Перекрестный выключатель (переключатель)",
            "info": "",
            "picture": ""
        },
        {
            "id": 971000804,
            "value": "Контактный зажим для трансформатора",
            "info": "",
            "picture": ""
        },
        {
            "id": 971007371,
            "value": "Программируемое реле",
            "info": "",
            "picture": ""
        },
        {
            "id": 971011903,
            "value": "Стекло для электрощита",
            "info": "",
            "picture": ""
        },
        {
            "id": 971024982,
            "value": "Огнестойкая кабельная оплетка",
            "info": "",
            "picture": ""
        },
        {
            "id": 971026808,
            "value": "Шина электротехническая",
            "info": "",
            "picture": ""
        },
        {
            "id": 971041143,
            "value": "Конденсатор",
            "info": "",
            "picture": ""
        },
        {
            "id": 971041402,
            "value": "Армированная пленка",
            "info": "",
            "picture": ""
        },
        {
            "id": 971062768,
            "value": "Аксессуар для телекоммуникационного шкафа",
            "info": "",
            "picture": ""
        },
        {
            "id": 971066339,
            "value": "Сигнальная индикаторная лампа",
            "info": "",
            "picture": ""
        },
        {
            "id": 971079478,
            "value": "Кабельный адаптер изоляционный",
            "info": "",
            "picture": ""
        },
        {
            "id": 971080401,
            "value": "Программируемый контроллер",
            "info": "",
            "picture": ""
        },
        {
            "id": 971093000,
            "value": "Магнитный пускатель",
            "info": "",
            "picture": ""
        },
        {
            "id": 971093227,
            "value": "Пускатель ручной кнопочный",
            "info": "",
            "picture": ""
        },
        {
            "id": 971095684,
            "value": "Кабельный ролик",
            "info": "",
            "picture": ""
        },
        {
            "id": 971099293,
            "value": "Зажим анкерный",
            "info": "",
            "picture": ""
        },
        {
            "id": 971157892,
            "value": "Концевой стопор",
            "info": "",
            "picture": ""
        },
        {
            "id": 971166998,
            "value": "Герметичная колодка",
            "info": "",
            "picture": ""
        },
        {
            "id": 971216310,
            "value": "Кабельный чулок",
            "info": "",
            "picture": ""
        },
        {
            "id": 971216323,
            "value": "Кабельный домкрат",
            "info": "",
            "picture": ""
        },
        {
            "id": 971216326,
            "value": "Вертлюг для монтажа кабеля",
            "info": "",
            "picture": ""
        },
        {
            "id": 971216329,
            "value": "Кабельная лебедка",
            "info": "",
            "picture": ""
        }
    ]    
}'

declare @id int
declare @name nvarchar(100)


select  id, name_ch
into OzonCharacteristicsValue
from openjson(@data) with(
json_result nvarchar(max) '$.result' as json
)cross apply openjson(json_result,'$') with(
id int '$.id',
name_ch nvarchar(100) '$.value')



--drop table CharacteristicsValue
--create table OzonCharacteristicsValue (id_ch int, value_ch nvarchar(100), id int identity(1,1) primary key )




